Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: In this case, when you commit files that match `*.c`, Git will run them through the indent program before it commits them and then run them through the `cat` program before it checks them back out onto disk.
cs: Pokud v tomto případě zapíšete soubory odpovídající masce `*.c`, Git je ještě před zapsáním prožene programem pro úpravu odsazování a poté, před checkoutem zpět na disk, i programem `cat`.

source: In this case, you already know what file it is.
cs: V tomto případě víte, o jaký soubor se jedná.

source: In this case, you can read an existing tree into your staging area as a subtree by using the `--prefix` option to `read-tree`:
cs: V tomto případě můžete načíst existující strom jako podstrom do oblasti připravených změn pomocí parametru `--prefix`, který zadáte k příkazu `read-tree`:

source: In this case, you can see your missing commit after the dangling commit.
cs: V tomto případě je vaše ztracená revize uvedena výrazem „dangling commit“.

source: In this case, you can try to rebase that branch on top of `origin/master`, resolve the conflicts for the maintainer, and then resubmit your changes:
cs: V takovém případě můžete zkusit přeskládat tuto větev na vrcholu větve `origin/master`, vyřešit za správce vzniklé konflikty a poté své změny ještě jednou odeslat:

source: In this case, you had a clean working directory when you tried to apply the stash, and you tried to apply it on the same branch you saved it from; but having a clean working directory and applying it on the same branch aren’t necessary to successfully apply a stash.
cs: V tomto případě jste měli čistý pracovní adresář, když jste se pokusili odklad aplikovat. Pokusili jste se ho aplikovat na stejnou větev, z níž jste ho uložili. K úspěšnému odkladu však není nezbytně nutné, aby byl pracovní adresář čistý ani abyste ho aplikovali na stejnou větev.

source: In this case, you have a couple of administrators, some documentation writers with access to the `doc` directory, and one developer who only has access to the `lib` and `tests` directories, and your ACL file looks like this:
cs: V našem příkladu máte několik správců, několik tvůrců dokumentace s přístupem do adresáře `doc` a jednoho vývojáře, který má jako jediný přístup do adresářů `lib` a `tests`. Soubor ACL proto bude vypadat následovně:

source: In this case, you imported 18 objects total for 5 commits into 1 branch.
cs: V tomto případě jsme importovali celkem 18 objektů 5 revizí do 1 větve.

source: In this case, you remove a file called passwords.txt from every snapshot, whether it exists or not.
cs: V tomto případě odstraníte soubor s názvem passwords.txt ze všech snímků, ať v nich existuje, nebo neexistuje.

source: In this case, your development history has diverged from some older point.
cs: V tomto případě se historie vývoje od určitého bodu v minulosti rozbíhala.

source: In this case, you’d do your work in a branch and then rebase your work onto `origin/master` when you were ready to submit your patches to the main project.
cs: V takovém případě budete pracovat ve své větvi, a až budete mít připraveny záplaty k odeslání do hlavního projektu, přeskládáte svou práci na větev `origin/master`.

source: In this case, you’re specifying a mode of `100644`, which means it’s a normal file.
cs: V tomto případě jste zadali režim `100644`, který znamená, že se jedná o běžný soubor.

source: In this case, you’re still on master.
cs: V našem případě jste však stále ještě na hlavní větvi.

source: In this chapter, I’ll go through some operations that you can use to make Git operate in a more customized fashion by introducing several important configuration settings and the hooks system.
cs: V této kapitole nastíním některé operace, jimiž lze Git přizpůsobit individuálním potřebám každého uživatele. Ukážeme si několik důležitých konfiguračních nastavení a systém zásuvných modulů.

source: In this chapter, you’ll see how to work with Git in a distributed environment as a contributor and an integrator.
cs: V této kapitole se dozvíte, jak pracovat se systémem Git v distribuovaném prostředí jako přispěvatel a zprostředkovatel integrace.

source: In this environment, you can follow a workflow similar to what you might do when using Subversion or another centralized system.
cs: V takovém prostředí můžete uplatnit podobný pracovní postup, na jaký jste možná zvyklí ze systému Subversion nebo jiného centralizovaného systému.

source: In this example, you’d run the following:
cs: V našem případě tedy provedete následující:

source: In this example, you’ll use the `authorized_keys` method for authenticating your users.
cs: V tomto příkladu použijeme k ověření identity uživatelů metodu `authorized_keys`.

source: In this next scenario, you’ll look at contributor roles in a larger private group.
cs: V následujícím scénáři se podíváme na role přispěvatelů ve větší soukromé skupině.

source: In this particular case, we’re using the `/var/www/htdocs` path that is common for Apache setups, but you can use any static web server — just put the bare repository in its path.
cs: V tomto konkrétním případě používáme cestu `/var/www/htdocs`, která je obvyklá u nastavení Apache, ale použít lze v podstatě jakýkoli statický webový server – stačí uložit holý repozitář do dané cesty.

source: In this scenario, all work is done in team-based branches and pulled together by the integrators later.
cs: V tomto scénáři se veškerá práce provádí ve větvích jednotlivých týmů a později je spojována zprostředkovateli integrace.

source: In this scenario, you have a `master` branch that contains basically stable code.
cs: V tomto scénáři obsahuje vaše větev `master` převážně jen stabilní kód.

source: In this scenario, you have two long-running branches, `master` and `develop`, in which you determine that `master` is updated only when a very stable release is cut and all new code is integrated into the `develop` branch.
cs: V tomto scénáři máte dvě dlouhodobé větve, hlavní větev `master` a větev `develop`. Určíte, že větev `master` bude aktualizována, pouze když je k dispozici velmi stabilní verze a do větve `develop` je integrován veškerý nový kód.

source: In this section you’ll learn what rebasing is, how to do it, why it’s a pretty amazing tool, and in what cases you won’t want to use it.
cs: V této části se dozvíte, co to je přeskládání, jak ho provést, v čem spočívají výhody tohoto nástroje a v jakých případech ho rozhodně nepoužívat.

source: In this section, we’ll cover some common workflows that this lightweight branching makes possible, so you can decide if you would like to incorporate it into your own development cycle.
cs: Proto se v této části podíváme na některé běžné pracovní postupy, které vám neobyčejně snadné větvení umožňuje, a můžete se zamyslet nad tím, zda větve při své vývojářské práci využijete, či nikoli.

source: In this section, we’ll cover these remote-management skills.
cs: V této části se zaměříme právě na správu vzdálených repozitářů.

source: In this section, you’ll cover how to accomplish these very useful tasks so that you can make your commit history look the way you want before you share it with others.
cs: V této části se dozvíte, jak se tyto velmi užitečné úkony provádějí, abyste mohli svou historii revizí před zveřejněním upravit podle svých představ.

source: In this section, you’ll learn about a few common patterns for contributing to a project.
cs: V této části ukážeme několik běžných schémat, podle nichž může přispívání do projektů probíhat.

source: In this section, you’ll learn about some of the attributes you can set on your paths in your Git project and see a few examples of using this feature in practice.
cs: V této části se podíváme na některé atributy, jež můžete pro různá umístění v projektu Git nastavit, a uvedeme pár příkladů, jak lze tuto funkci využít v praxi.

source: In this section, you’ll learn how to list the available tags, how to create new tags, and what the different types of tags are.
cs: V této části vysvětlíme, jak pořídíte výpis všech dostupných značek, jak lze vytvářet značky nové a jaké typy značek se vám nabízejí.

source: In this section, you’ll use what you’ve learned to establish a Git workflow that checks for a custom commit message format, enforces fast-forward-only pushes, and allows only certain users to modify certain subdirectories in a project.
cs: V této části použijeme to, co jsme se naučili o vytváření pracovního postupu v systému Git. Systém může kontrolovat formát uživatelovy zprávy k revizi, dovolit pouze aktualizace „rychle vpřed“ a umožňovat změnu obsahu konkrétních podadresářů projektu pouze vybraným uživatelům.

source: Initial commit history with featureB work.
cs: Výchozí historie revizí s větví featureB

source: Insert 18333fig0101.png Figure 1-1.
cs: Insert 18333fig0101.png Obrázek 1-1.

source: Insert 18333fig0102.png Figure 1-2.
cs: Insert 18333fig0102.png Obrázek 1-2.

source: Insert 18333fig0103.png Figure 1-3.
cs: Insert 18333fig0103.png Obrázek 1-3.

source: Insert 18333fig0104.png Figure 1-4.
cs: Insert 18333fig0104.png Obrázek 1-4.

source: Insert 18333fig0105.png Figure 1-5.
cs: Insert 18333fig0105.png Obrázek 1-5.

source: Insert 18333fig0106.png Figure 1-6.
cs: Insert 18333fig0106.png Obrázek 1-6.

source: Insert 18333fig0107.png Figure 1-7.
cs: Insert 18333fig0107.png Obrázek 1-7.

source: Insert 18333fig0201.png Figure 2-1.
cs: Insert 18333fig0201.png Obrázek 2-1.

source: Insert 18333fig0202.png Figure 2-2.
cs: Insert 18333fig0202.png Obrázek 2-2.

source: Insert 18333fig0301.png Figure 3-1.
cs: Insert 18333fig0301.png Obrázek 3-1.

source: Insert 18333fig0302.png Figure 3-2.
cs: Insert 18333fig0302.png Obrázek 3-2.

source: Insert 18333fig0303.png Figure 3-3.
cs: Insert 18333fig0303.png Obrázek 3-3.

source: Insert 18333fig0304.png Figure 3-4.
cs: Insert 18333fig0304.png Obrázek 3-4.

source: Insert 18333fig0305.png Figure 3-5.
cs: Insert 18333fig0305.png Obrázek 3-5.

source: Insert 18333fig0306.png Figure 3-6.
cs: Insert 18333fig0306.png Obrázek 3-6.

source: Insert 18333fig0307.png Figure 3-7.
cs: Insert 18333fig0307.png Obrázek 3-7.

source: Insert 18333fig0308.png Figure 3-8.
cs: Insert 18333fig0308.png Obrázek 3-8.

source: Insert 18333fig0309.png Figure 3-9.
cs: Insert 18333fig0309.png Obrázek 3-9.

source: Insert 18333fig0310.png Figure 3-10.
cs: Insert 18333fig0310.png Obrázek 3-10.

source: Insert 18333fig0311.png Figure 3-11.
cs: Insert 18333fig0311.png Obrázek 3-11.

source: Insert 18333fig0312.png Figure 3-12.
cs: Insert 18333fig0312.png Obrázek 3-12.

source: Insert 18333fig0313.png Figure 3-13.
cs: Insert 18333fig0313.png Obrázek 3-13.

source: Insert 18333fig0314.png Figure 3-14.
cs: Insert 18333fig0314.png Obrázek 3-14.

source: Insert 18333fig0315.png Figure 3-15.
cs: Insert 18333fig0315.png Obrázek 3-15.

source: Insert 18333fig0316.png Figure 3-16.
cs: Insert 18333fig0316.png Obrázek 3-16.

source: Insert 18333fig0317.png Figure 3-17.
cs: Insert 18333fig0317.png Obrázek 3-17.

source: Insert 18333fig0318.png Figure 3-18.
cs: Insert 18333fig0318.png Obrázek 3-18.

source: Insert 18333fig0319.png Figure 3-19.
cs: Insert 18333fig0319.png Obrázek 3-19.

source: Insert 18333fig0320.png Figure 3-20.
cs: Insert 18333fig0320.png Obrázek 3-20.

source: Insert 18333fig0321.png Figure 3-21.
cs: Insert 18333fig0321.png Obrázek 3-21.

source: Insert 18333fig0322.png Figure 3-22.
cs: Insert 18333fig0322.png Obrázek 3-22.

source: Insert 18333fig0323.png Figure 3-23.
cs: Insert 18333fig0323.png Obrázek 3-23.

source: Insert 18333fig0324.png Figure 3-24.
cs: Insert 18333fig0324.png Obrázek 3-24.

source: Insert 18333fig0325.png Figure 3-25.
cs: Insert 18333fig0325.png Obrázek 3-25.

source: Insert 18333fig0326.png Figure 3-26.
cs: Insert 18333fig0326.png Obrázek 3-26.

source: Insert 18333fig0327.png Figure 3-27.
cs: Insert 18333fig0327.png Obrázek 3-27.

source: Insert 18333fig0328.png Figure 3-28.
cs: Insert 18333fig0328.png Obrázek 3-28.

source: Insert 18333fig0329.png Figure 3-29.
cs: Insert 18333fig0329.png Obrázek 3-29.

source: Insert 18333fig0330.png Figure 3-30.
cs: Insert 18333fig0330.png Obrázek 3-30.

source: Insert 18333fig0331.png Figure 3-31.
cs: Insert 18333fig0331.png Obrázek 3-31.

source: Insert 18333fig0332.png Figure 3-32.
cs: Insert 18333fig0332.png Obrázek 3-32.

source: Insert 18333fig0333.png Figure 3-33.
cs: Insert 18333fig0333.png Obrázek 3-33.

source: Insert 18333fig0334.png Figure 3-34.
cs: Insert 18333fig0334.png Obrázek 3-34.

source: Insert 18333fig0335.png Figure 3-35.
cs: Insert 18333fig0335.png Obrázek 3-35.

source: Insert 18333fig0336.png Figure 3-36.
cs: Insert 18333fig0336.png Obrázek 3-36.

source: Insert 18333fig0337.png Figure 3-37.
cs: Insert 18333fig0337.png Obrázek 3-37.

source: Insert 18333fig0338.png Figure 3-38.
cs: Insert 18333fig0338.png Obrázek 3-38.

source: Insert 18333fig0339.png Figure 3-39.
cs: Insert 18333fig0339.png Obrázek 3-39.

source: Insert 18333fig0401.png Figure 4-1.
cs: Insert 18333fig0401.png Obrázek 4-1.

source: Insert 18333fig0402.png Figure 4-2.
cs: Insert 18333fig0402.png Obrázek 4-2.

source: Insert 18333fig0403.png Figure 4-3.
cs: Insert 18333fig0403.png Obrázek 4-3.

source: Insert 18333fig0404.png Figure 4-4.
cs: Insert 18333fig0404.png Obrázek 4-4.

source: Insert 18333fig0405.png Figure 4-5.
cs: Insert 18333fig0405.png Obrázek 4-5.

source: Insert 18333fig0406.png Figure 4-6.
cs: Insert 18333fig0406.png Obrázek 4-6.

source: Insert 18333fig0407.png Figure 4-7.
cs: Insert 18333fig0407.png Obrázek 4-7.

source: Insert 18333fig0408.png Figure 4-8.
cs: Insert 18333fig0408.png Obrázek 4-8.

source: Insert 18333fig0409.png Figure 4-9.
cs: Insert 18333fig0409.png Obrázek 4-9.

source: Insert 18333fig0410.png Figure 4-10.
cs: Insert 18333fig0410.png Obrázek 4-10.

source: Insert 18333fig0411.png Figure 4-11.
cs: Insert 18333fig0411.png Obrázek 4-11.

source: Insert 18333fig0412.png Figure 4-12.
cs: Insert 18333fig0412.png Obrázek 4-12.

source: Insert 18333fig0413.png Figure 4-13.
cs: Insert 18333fig0413.png Obrázek 4-13.

source: Insert 18333fig0414.png Figure 4-14.
cs: Insert 18333fig0414.png Obrázek 4-14.

source: Insert 18333fig0415.png Figure 4-15.
cs: Insert 18333fig0415.png Obrázek 4-15.

source: Insert 18333fig0501.png Figure 5-1.
cs: Insert 18333fig0501.png Obrázek 5-1.

source: Insert 18333fig0502.png Figure 5-2.
cs: Insert 18333fig0502.png Obrázek 5-2.

source: Insert 18333fig0503.png Figure 5-3.
cs: Insert 18333fig0503.png Obrázek 5-3.

source: Insert 18333fig0504.png Figure 5-4.
cs: Insert 18333fig0504.png Obrázek 5-4.

source: Insert 18333fig0505.png Figure 5-5.
cs: Insert 18333fig0505.png Obrázek 5-5.

source: Insert 18333fig0506.png Figure 5-6.
cs: Insert 18333fig0506.png Obrázek 5-6.

source: Insert 18333fig0507.png Figure 5-7.
cs: Insert 18333fig0507.png Obrázek 5-7.

source: Insert 18333fig0508.png Figure 5-8.
cs: Insert 18333fig0508.png Obrázek 5-8.

source: Insert 18333fig0509.png Figure 5-9.
cs: Insert 18333fig0509.png Obrázek 5-9.

source: Insert 18333fig0510.png Figure 5-10.
cs: Insert 18333fig0510.png Obrázek 5-10.

source: Insert 18333fig0511.png Figure 5-11.
cs: Insert 18333fig0511.png Obrázek 5-11.

source: Insert 18333fig0512.png Figure 5-12.
cs: Insert 18333fig0512.png Obrázek 5-12.

source: Insert 18333fig0513.png Figure 5-13.
cs: Insert 18333fig0513.png Obrázek 5-13.

source: Insert 18333fig0514.png Figure 5-14.
cs: Insert 18333fig0514.png Obrázek 5-14.

source: Insert 18333fig0515.png Figure 5-15.
cs: Insert 18333fig0515.png Obrázek 5-15.

source: Insert 18333fig0516.png Figure 5-16.
cs: Insert 18333fig0516.png Obrázek 5-16.

source: Insert 18333fig0517.png Figure 5-17.
cs: Insert 18333fig0517.png Obrázek 5-17.

source: Insert 18333fig0518.png Figure 5-18.
cs: Insert 18333fig0518.png Obrázek 5-18.

source: Insert 18333fig0519.png Figure 5-19.
cs: Insert 18333fig0519.png Obrázek 5-19.

source: Insert 18333fig0520.png Figure 5-20.
cs: Insert 18333fig0520.png Obrázek 5-20.

source: Insert 18333fig0521.png Figure 5-21.
cs: Insert 18333fig0521.png Obrázek 5-21.

source: Insert 18333fig0522.png Figure 5-22.
cs: Insert 18333fig0522.png Obrázek 5-22.

source: Insert 18333fig0523.png Figure 5-23.
cs: Insert 18333fig0523.png Obrázek 5-23.

source: Insert 18333fig0524.png Figure 5-24.
cs: Insert 18333fig0524.png Obrázek 5-24.

source: Insert 18333fig0525.png Figure 5-25.
cs: Insert 18333fig0525.png Obrázek 5-25.

source: Insert 18333fig0526.png Figure 5-26.
cs: Insert 18333fig0526.png Obrázek 5-26.

source: Insert 18333fig0527.png Figure 5-27.
cs: Insert 18333fig0527.png Obrázek 5-27.

source: Insert 18333fig0601.png Figure 6-1.
cs: Insert 18333fig0601.png Obrázek 6-1.

source: Insert 18333fig0701.png Figure 7-1.
cs: Insert 18333fig0701.png Obrázek 7-1.

source: Insert 18333fig0702.png Figure 7-2.
cs: Insert 18333fig0702.png Obrázek 7-2.

source: Insert 18333fig0703.png Figure 7-3.
cs: Insert 18333fig0703.png Obrázek 7-3.

source: Insert 18333fig0901.png Figure 9-1.
cs: Insert 18333fig0901.png Obrázek 9-1.

source: Insert 18333fig0902.png Figure 9-2.
cs: Insert 18333fig0902.png Obrázek 9-2.

source: Insert 18333fig0903.png Figure 9-3.
cs: Insert 18333fig0903.png Obrázek 9-3.

source: Insert 18333fig0904.png Figure 9-4.
cs: Insert 18333fig0904.png Obrázek 9-4.

source: Installing Git on Windows is very easy.
cs: Instalace systému Git v OS Windows je velice nenáročná.

source: Installing Gitolite is very easy, even if you don’t read the extensive documentation that comes with it.
cs: Instalace Gitolite je velmi jednoduchá a to i když si nepřečtete obsáhlou dokumentaci, která je k dispozici.

source: Installing Gitosis isn’t the simplest task ever, but it’s not too difficult.
cs: Instalace nástroje Gitosis sice nepatří mezi nejsnazší, ale není ani příliš složitá.

source: Instead of
cs: Místo

source: Instead of "I added tests for" or "Adding tests for," use "Add tests for." Here is a template originally written by Tim Pope at tpope.net:
cs: Místo „I added tests for“ nebo „Adding tests for“ používejte raději „Add tests for“. Zde uvádíme vzor, jehož autorem je Tim Pope a v originále je k nalezení na stránkách tpope.net:

source: Instead of "updated README formatting and added blame", you want to split it into two commits: "updated README formatting" for the first, and "added blame" for the second.
cs: Revizi „updated README formatting and added blame“ chcete rozdělit do dvou jiných: „updated README formatting“ jako první a „added blame“ jako druhou.

source: Instead of being primarily based on the project, GitHub is user-centric.
cs: Ten tu není založen primárně na názvu projektu, ale na uživateli.

source: Instead of commits that look like this
cs: Revize už nebudou mít tuto podobu:

source: Instead of forking the project and pushing to your own writable version, you generate e-mail versions of each commit series and e-mail them to the developer mailing list:
cs: Místo toho, abyste rozštěpili projekt a odeslali své změny do vlastní zapisovatelné verze, vygenerujete e-mailovou verzi každé série revizí a pošlete je e-mailem do poštovní konference vývojářů:

source: Instead of getting the diff output on the command line, Git fires up P4Merge, which looks something like Figure 7-1.
cs: Výstup příkazu diff se nezobrazí na příkazovém řádku, ale Git spustí program P4Merge v podobě, jak je zachycen na obrázku 7-1.

source: Instead of just moving the branch pointer forward, Git creates a new snapshot that results from this three-way merge and automatically creates a new commit that points to it (see Figure 3-17).
cs: Git tentokrát neposune ukazatel větve vpřed, ale vytvoří nový snímek jako výsledek tohoto třícestného sloučení a automaticky vytvoří novou revizi, která bude na snímek ukazovat (viz obrázek 3-17).

source: Instead of reading from stdin, this script takes three arguments: the name of the reference (branch), the SHA-1 that reference pointed to before the push, and the SHA-1 the user is trying to push.
cs: Tento skript nenačítá data ze standardního vstupu, místo nich používá tři jiné parametry: název reference (větve), hodnotu SHA-1, na niž reference ukazovala před odesláním, a hodnotu SHA-1, kterou se uživatel pokouší odeslat.

source: Instead of writing your own Atom-generating code, you decide to use a library.
cs: Místo abyste psali vlastní zdrojový kód ke kanálům Atom, rozhodnete se použít knihovnu.

source: Instead, Git records it as a particular commit from that repository.
cs: Místo toho si Git zaznamená konkrétní revizi z tohoto repozitáře.

source: Instead, Git thinks of its data more like a set of snapshots of a mini filesystem.
cs: Chápe je spíše jako sadu snímků (snapshots) vlastního malého systému souborů.

source: Instead, you must run `git diff-tree` with the branch you want to compare to:
cs: V tomto případě je třeba zadat příkaz `git diff-tree` a větev, s níž chcete srovnání provést:

source: Instructions for a new repository.
cs: Instrukce k novému repozitáři

source: Integration-manager workflow.
cs: Pracovní postup s integračním manažerem

source: Is a lieutenant system in place, and do you have to submit your work to them first?
cs: Jsou součástí systému poručíci a musíte všechnu svou práci odesílat nejprve jim?

source: Is it centralized, with each developer having equal write access to the main codeline?
cs: Probíhá vývoj centralizovaně, má každý vývojář stejné oprávnění pro zápis do hlavní linie kódu?

source: It adds a section to your `.git/config` file, specifying the name of the remote (`origin`), the URL of the remote repository, and the refspec for fetching:
cs: Přidáte tím novou část do souboru `.git/config`, určíte název vzdáleného serveru (`origin`), URL vzdáleného repozitáře a refspec pro vyzvednutí dat:

source: It adds, removes, and modifies files automatically to make sure your working copy is what the branch looked like on your last commit to it.
cs: Automaticky budou přidány, odstraněny a upraveny soubory tak, aby byla vaše pracovní kopie totožná se stavem větve v okamžiku, kdy jste na ni zapsali poslední revizi.

source: It also allows you to assign a new permission mode (`C`) which enables users to create repositories based on such wild cards, automatically assigns ownership to the specific user who created it, allows him/her to hand out `R` and `RW` permissions to other users to collaborate, etc. Again, please see the documentation for details.
cs: Umožní nám též přidělit nový režim oprávnění (`C`), který uživatelům povoluje vytvářet repozitáře popsané zástupnými znaky, automaticky přidělí vlastnictví konkrétnímu uživateli, který jej vytvořil, umožní mu přidělit oprávnění `R` a `RW` dalším spolupracovníkům atd. Podrobnosti opět hledejte v dokumentaci.

source: It also handles file adds, deletes, and renames if they’re described in the `git diff` format, which `patch` won’t do.
cs: Poradí si také s přidanými, odstraněnými a přejmenovanými soubory, jsou-li popsány ve formátu `git diff`, což příkaz `patch` nedělá.

source: It also lists all the remote references it has pulled down.
cs: Součástí výpisu jsou také všechny vzdálené reference, které příkaz stáhl.

source: It also puts a summary of the information at the end.
cs: Zároveň vloží na konec výpisu shrnutí těchto informací.

source: It also requires firewall access to port 9418, which isn’t a standard port that corporate firewalls always allow.
cs: Vyžaduje rovněž povolení přístupu k portu 9418 skrz firewall. Tento port nepatří mezi standardní porty, které by firemní firewally vždy povolovaly.
